posts/emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-11-16 Wed 19:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why I use Emacs</title>
<meta name="author" content="Donatas Petrauskas" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../assets/css/styles.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Why I use Emacs</h1>
<blockquote>
<p>
How do you tell if somebody's using Emacs?
</p>

<p>
They'll let you know by writing an article about it. In Org Mode.
</p>
</blockquote>

<p>
There are many interesting and valid reasons people give to rationalise their love for and reliance on "archaic" and "exotic" software known as Emacs. I often hear<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> mentions of some packages or extensibility as selling points. I watch videos full of complicated and beautiful Emacs configurations that does something really well. I read others' <code>init.el</code> files. And I wonder why my setup is so plain. Am I missing out? Why did I stay with Emacs for so long? I'm clearly unable to wield Emacs Lisp and transform this caterpillar to The Ultimate Integrated Computing <a href="https://xkcd.com/378/">Butterfly</a>.
</p>

<p>
The answer is simple: I don't want to. Extensibility and flexibility is nice to have and it's a prerequisite for having such a diverse and abundant package ecosystem. But in the end, I'm sticking to Emacs because it provides me with cohesive interface for my computing needs. Text based, more or less standard key bindings across, and most importantly immaculate and extensive integrated documentation.
</p>

<p>
I changed technologies and operating systems throughout my professional career and it helped to have something as stable, reliable, and amendable as Emacs. And it's true, as everyone else says, it requires time investment. But so does any other skill.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
And by "hear" I mean "read". Never met another Emacs user in my life. Not that I tried.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<nav id="navigation">
  <ul>
    <li><a href="../index.html">Index</a></li>
    <li>&middot;</li>
    <li><a href="https://github.com/dop">GitHub</a></li>
    <li><a href="https://gitlab.com/setq">GitLab</a></li>
    <li><a href="https://twitter.com/donatas_p">Twitter</a></li>
  </ul>
</nav>

<script async src="https://www.googletagmanager.com/gtag/js?id=G-SLMC8MREG7"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());
  gtag('config', 'G-SLMC8MREG7');
</script>
</div>
</body>
</html>
